# (실습) 데이터프레임 중심 프로그래밍

In [5]:
import numpy as np
import pandas as pd

**문제 1**

아래의 딕셔너리 `data`를 이용하여 데이터프레임`df1`를 생성한다.

In [28]:
data = {'A' : [0, 5, 15, 20, 25, 30, 35, 40],
        'B' : [1, 2, 3, 4, 5, 6, 7, 8],
        'C' : [3, 3, 3, 3, 3, 3, 3, 3],
        'D' : [4, 2, 9, 1, 20, 3, 15, 17]}

df1 = pd.DataFrame(data)
df1

    A  B  C   D
0   0  1  3   4
1   5  2  3   2
2  15  3  3   9
3  20  4  3   1
4  25  5  3  20
5  30  6  3   3
6  35  7  3  15
7  40  8  3  17

(1) `df1`의 각 열의 합을 계산하는 한 줄 표현식을 작성하여라.

답:

In [29]:
df1.sum(axis=0)

A    170
B     36
C     24
D     71
dtype: int64

(2) `df1`의 각 행의 합을 계산하는 한 줄 표현식을 작성하여라.

답:

In [30]:
df1.sum(axis=1)

0     8
1    12
2    30
3    28
4    53
5    42
6    60
7    68
dtype: int64

**문제 2**

아래 데이터프레임을 생성하기 위해 `pd.date_range()` 함수는 시간으로 구성된 인덱스 자료형을 생성한다.
함수 호출에 사용된 키워드 인자의 의미는 다음과 같다.

- `start="20130101`: 2013년 1월 1일부터 시작
- `periods=6`: 첫째 인자로 지정된 시간부터 6 개의 시간 데이터 샘플 생성
- `freq="D"`: 시간 데이터 샘플을 일(day) 단위로 생성

In [18]:
dates = pd.date_range(start="20130101", periods=6, freq="D")
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
np.random.seed(0)

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("CDAB"))
df

                   C         D         A         B
2013-01-01  1.764052  0.400157  0.978738  2.240893
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-03 -0.103219  0.410599  0.144044  1.454274
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-05  1.494079 -0.205158  0.313068 -0.854096
2013-01-06 -2.552990  0.653619  0.864436 -0.742165

(1) 열 라벨을 기준으로 오름차순으로 정렬된 데이터프레임을 생성하는 한 줄 표현식을 작성하여라.

답:

In [23]:
df.sort_index(axis=1)

                   A         B         C         D
2013-01-01  0.978738  2.240893  1.764052  0.400157
2013-01-02  0.950088 -0.151357  1.867558 -0.977278
2013-01-03  0.144044  1.454274 -0.103219  0.410599
2013-01-04  0.443863  0.333674  0.761038  0.121675
2013-01-05  0.313068 -0.854096  1.494079 -0.205158
2013-01-06  0.864436 -0.742165 -2.552990  0.653619

(2) 열 라벨을 기준으로 내림차순으로 정렬된 데이터프레임을 생성하는 한 줄 표현식을 작성하여라.

In [24]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.400157  1.764052  2.240893  0.978738
2013-01-02 -0.977278  1.867558 -0.151357  0.950088
2013-01-03  0.410599 -0.103219  1.454274  0.144044
2013-01-04  0.121675  0.761038  0.333674  0.443863
2013-01-05 -0.205158  1.494079 -0.854096  0.313068
2013-01-06  0.653619 -2.552990 -0.742165  0.864436

(3) `B` 라벨 열의 항목을 기준으로 오름차순으로 정렬된 데이터프레임을 생성하는 한 줄 표현식을 작성하여라.

In [25]:
    df.sort_values(by='B')

                   C         D         A         B
2013-01-05  1.494079 -0.205158  0.313068 -0.854096
2013-01-06 -2.552990  0.653619  0.864436 -0.742165
2013-01-02  1.867558 -0.977278  0.950088 -0.151357
2013-01-04  0.761038  0.121675  0.443863  0.333674
2013-01-03 -0.103219  0.410599  0.144044  1.454274
2013-01-01  1.764052  0.400157  0.978738  2.240893

### 통계

In [89]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.262489  5  NaN
2013-01-02  3.000000  3.000000  3.000000  3  3.0
2013-01-03  4.000000  4.000000  4.000000  4  4.0
2013-01-04  0.363123 -0.158695  0.987462  5  3.0
2013-01-05  0.255047 -0.653083  0.487718  5  4.0
2013-01-06  0.016019 -1.277266 -1.912686  5  5.0

`F` 열은 결측치를 제외한 5개의 값의 평균값을 구한다.

In [90]:
df.mean()

A    1.272365
B    0.818493
C    1.137497
D    4.500000
F    3.800000
dtype: float64

결측치는 모든 연산에서 무시된다.
실제로 `F` 열에서 결측치를 제외한 항목 개수는 5이다.

In [91]:
df.F.value_counts()

3.0    2
4.0    2
5.0    1
Name: F, dtype: int64

In [92]:
df.F.value_counts().sum()

5

결측치를 제외한 항목의 합을 5로 나눈 값은 3.8이다.

In [93]:
df.F.sum()/5

3.8

축을 지정하면 행 또는 열 기준으로 작동한다.

- 행별 평균값

In [94]:
df.mean(1) # axis=1

2013-01-01    1.315622
2013-01-02    3.000000
2013-01-03    4.000000
2013-01-04    1.838378
2013-01-05    1.817936
2013-01-06    1.365213
Freq: D, dtype: float64

### 사칙연산

In [95]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

결측치를 더 추가한다.

참고; [`DataFrame.shift()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.shift.html)

In [96]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

- 행별 뺄셈: `df - s`

In [97]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.262489  5  NaN
2013-01-02  3.000000  3.000000  3.000000  3  3.0
2013-01-03  4.000000  4.000000  4.000000  4  4.0
2013-01-04  0.363123 -0.158695  0.987462  5  3.0
2013-01-05  0.255047 -0.653083  0.487718  5  4.0
2013-01-06  0.016019 -1.277266 -1.912686  5  5.0

결측치가 관여하면 무조건 결측치로 처리된다.

In [98]:
df.sub(s, axis='index') # axis=0

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  3.000000  3.000000  3.000000  3.0  3.0
2013-01-04 -2.636877 -3.158695 -2.012538  2.0  0.0
2013-01-05 -4.744953 -5.653083 -4.512282  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

- 브로드캐스팅: 필요에 따라 자동 적용

In [99]:
df - 5

                   A         B         C  D    F
2013-01-01 -5.000000 -5.000000 -4.737511  0  NaN
2013-01-02 -2.000000 -2.000000 -2.000000 -2 -2.0
2013-01-03 -1.000000 -1.000000 -1.000000 -1 -1.0
2013-01-04 -4.636877 -5.158695 -4.012538  0 -2.0
2013-01-05 -4.744953 -5.653083 -4.512282  0 -1.0
2013-01-06 -4.983981 -6.277266 -6.912686  0  0.0

### 함수 적용

- 참고: [`DataFrame.apply()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply)

In [100]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.262489  5  NaN
2013-01-02  3.000000  3.000000  3.000000  3  3.0
2013-01-03  4.000000  4.000000  4.000000  4  4.0
2013-01-04  0.363123 -0.158695  0.987462  5  3.0
2013-01-05  0.255047 -0.653083  0.487718  5  4.0
2013-01-06  0.016019 -1.277266 -1.912686  5  5.0

- 열별 누적합

In [101]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.262489   5   NaN
2013-01-02  3.000000  3.000000  3.262489   8   3.0
2013-01-03  7.000000  7.000000  7.262489  12   7.0
2013-01-04  7.363123  6.841305  8.249951  17  10.0
2013-01-05  7.618170  6.188222  8.737669  22  14.0
2013-01-06  7.634189  4.910956  6.824983  27  19.0

- 행별 누적합

In [102]:
df.apply(np.cumsum, axis='columns') # axis=1

                   A         B          C          D          F
2013-01-01  0.000000  0.000000   0.262489   5.262489        NaN
2013-01-02  3.000000  6.000000   9.000000  12.000000  15.000000
2013-01-03  4.000000  8.000000  12.000000  16.000000  20.000000
2013-01-04  0.363123  0.204428   1.191890   6.191890   9.191890
2013-01-05  0.255047 -0.398036   0.089682   5.089682   9.089682
2013-01-06  0.016019 -1.261247  -3.173933   1.826067   6.826067

- 열별 최대값과 최소값의 차이. 결측치는 무시

In [103]:
df.apply(lambda x: x.max() - x.min())

A    4.000000
B    5.277266
C    5.912686
D    2.000000
F    2.000000
dtype: float64

- 행별 최대값과 최소값의 차이. 결측치는 무시

In [104]:
df.apply(lambda x: x.max() - x.min(), axis=1)

2013-01-01    5.000000
2013-01-02    0.000000
2013-01-03    0.000000
2013-01-04    5.158695
2013-01-05    5.653083
2013-01-06    6.912686
Freq: D, dtype: float64